const express = require("express"),
  app = express(),
  passport = require("passport"),
  port = process.env.PORT || 80,
  cors = require("cors"),
  cookie = require("cookie");

const bcrypt = require("bcrypt");

const db = require("./database.js");
let users = db.users;

require("./passport.js");

const router = require("express").Router(),
  jwt = require("jsonwebtoken");

app.use("/api", router);
router.use(cors({ origin: "http://localhost:3000", credentials: true }));
router.use(express.json());
router.use(express.urlencoded({ extended: false }));

router.post("/login", (req, res, next) => {
  passport.authenticate("local", { session: false }, (err, user, info) => {
    console.log("Login: ", req.body, user, err, info);
    if (err) return next(err);
    if (user) {
        if (req.body.remember == true) {
          time_exp = "7d";
        } else time_exp = "1d";
        const token = jwt.sign(user, db.SECRET, {
          expiresIn: time_exp,
        });
        var decoded = jwt.decode(token);
        let time = new Date(decoded.exp * 1000);
        console.log(new Date(decoded.exp * 1000));
        res.setHeader(
          "Set-Cookie",
          cookie.serialize("token", token, {
              httpOnly: true,
              secure: process.env.NODE_ENV !== "development",
              maxAge: 60 * 60,
              sameSite: "strict",
              path: "/",
          })
      );
      res.statusCode = 200;
      return res.json({ user, token });
    } else return res.status(422).json(info);
  })(req, res, next);
});

router.get("/logout", (req, res) => {
  res.setHeader(
    "Set-Cookie",
    cookie.serialize("token", "", {
      httpOnly: true,
      secure: process.env.NODE_ENV !== "development",
      maxAge: -1,
      sameSite: "strict",
      path: "/",
    })
  );
  res.statusCode = 200;
  return res.json({ message: "Logout successful" });
});

/* GET user profile. */
router.get(
  "/profile",
  passport.authenticate("jwt", { session: false }),
  (req, res, next) => {
    res.send(req.user);
  }
);
/* GET user foo. */
router.get(
  "/foo",
  passport.authenticate("jwt", { session: false }),
  (req, res, next) => {
      res.status(200).json({ message: "Foo" });
  }
);

router.post("/register", async (req, res) => {
  try {
    const SALT_ROUND = 10;
    const { username, email, password } = req.body;
    if (!username || !email || !password)
      return res.json({ message: "Cannot register with empty string" });
    if (db.checkExistingUser(username) !== db.NOT_FOUND)
      return res.json({ message: "Duplicated user" });

    let id = users.users.length? users.users[users.users.length - 1].id + 1: 1;
    hash = await bcrypt.hash(password, SALT_ROUND);
    users.users.push({ id, username, password: hash, email });
    res.status(200).json({ message: "Register success" });
  } catch {
    res.status(422).json({ message: "Cannot register" });
  }
});

router.get("/alluser", (req, res) => res.json(db.users.users));

router.get("/", (req, res, next) => {
  res.send("Respond without authentication");
});

  let thaidesserts = {
      list: [
        { "id": 1, "Dessert": "จ่ามงกุฎ","Mean": "อยู่ตำแหน่งสูงสุดเสมือนมงกุฎ แสดงถึงความมีเกียรติยศชื่อเสียง","Popular": "ให้ผู้ที่ได้รับการยกย่องอย่างสูงเนื่องจากมีวิธีทำที่ค่อนข้างยาก" ,"Ingredient": "แป้งสาลี 2 ถ้วย,ไข่แดง 6 ฟอง,น้ำตาลทราย 1 ถ้วย,น้ำดอกมะลิ 2 ถ้วย,เมล็ดแตงโมแกะเปลือก,ทองคำเปลวแปะหน้าขนม","Procedure": "เคี่ยวน้ำตาลกับน้ำดอกมะลิ จากนั้นกรองด้วยผ้าขาวบาง, คั่วเม็ดแตงโมในกระทะทองเหลือง แล้วนำไปชุบน้ำเชื่อม จนน้ำตาลเกาะเม็ดแตงโม, แป้งผสมกับไข่แดง นวดให้เข้ากันจนส่วนผสมนิ่มดี แบ่งแป้งออกมาทำเป็นรองคลึงแป้งให้ได้เป็นแผ่นบางๆ เอามือกดให้ได้เป็นทรงก้นถ้วยน้ำ นำไปอบให้สุก, จากนั้นใส่น้ำตาลผสมกับน้ำเล็กน้อยยกขึ้นตั้งไฟ ให้เหนียว ใช้ติดเม็ดแตงโมกับฐาน ทำเป็นมงกุฎ, ปั้นแป้งที่เหลือเป็นทรงกลม นำมาวางที่ฐานแล้วใช้มีดแบ่งเป็น, ส่วนเหมือนมะยม จากนั้นปั้นเป็นลูกกลมเล็กๆแปะไว้ข้างบนแล้วติดด้วยทองคำเปลว" ,"imageUrl": "/pj1.jpg" },
        { "id": 2, "Dessert": "ขนมชั้น","Mean": "การได้เลื่อนชั้น เลื่อนตำแหน่ง เลื่อนยศฐาบรรดาศักดิ์","Popular": "ทำให้มี 9 ชั้น เพื่อความเป็นสิริมงคล" ,"Ingredient": "แป้งข้าวเจ้า 40 กรัม, แป้งท้าวยายม่อม 40 กรัม, แป้งมัน 300 กรัม, กะทิ 500 มิลลิลิตร, น้ำตาลทราย 500 กรัม, ใบเตย 3-4 ใบ, กลิ่นมะลิ 1/2 ช้อนชา, น้ำใบเตย 1/4 ถ้วย" ,"Procedure": "ผสมน้ำตาลทรายกับกะทิ แล้วนำไปตั้งไฟอ่อนๆ พอให้อุ่นจนน้ำตาลทรายเริ่มละลาย ไม่ต้องต้มให้เดือด เสร็จแล้ววางพักไว้, ผสมแป้งทั้งสามอย่างเข้าด้วยกัน แล้วค่อยๆ เติมน้ำกะทิลงไป คนจนแป้งละลาย หากไม่แน่ใจว่าแป้งละลายหมด ให้นำไปกรองกับกระชอนตาถี, แบ้งน้ำกะทิไว้สองชาม ชามแรกผสมกลิ่นมะลิลงไป คนให้เข้ากัน อีกหนึ่งชามใส่น้ำใบเตยลงไป คนให้เข้ากัน, เตรียมพิมพ์สำหรับขนมชั้น ใส่น้ำในลังถึง ต้มน้ำจนเดือด แล้วนำแม่พิมพ์ลงไปนึ่งวอร์มก่อน 15 นาที, เสร็จแล้วก็เทขนมลงไปทีละชั้น ชั้นละเท่าๆ กัน ระหว่างสลับสีกันให้นึ่งชั้นละ 5 นาที จนเต็มแม่พิมพ, นึ่งเสร็จแล้ว นำขนมออกมาหั่นเป็นชิ้นสี่เหลี่ยม","imageUrl": "/pj2.jpg" },
        { "id": 3, "Dessert": "ทองเอก","Mean": "ความก้าวหน้าทางการงาน","Popular": "ใช้เป็นขนมอวยพรเมื่อได้เลื่อนตำแหน่งหน้าที่การงาน" ,"Ingredient": "แป้งสาลีอเนกประสงค์ 2+1/2 ถ้วย,กะทิ 2+1/2 ถ้วย, น้ำตาลทราย 2+1/2 ถ้วย, ไข่ไก่เฉพาะไข่แดง 14 ฟอง, แป้งเท้ายายม่อม 2 ช้อนโต๊ะ, แบบพิมพ์สำหรับกดขนม, แผ่นทองคำเปลว" ,"Procedure": "ใส่กะทิและน้ำตาลทรายลงในกระทะทองเหลือง นำขึ้นตั้งไฟปานกลาง ต้มจนเดือดแล้วกรองด้วยผ้าขาว เสร็จเคี่ยวต่อจนข้น ปิดไฟ พักไว้ให้เย็น, ใส่ไข่แดงลงไป คนให้เข้ากัน ยกส่วนผสมขึ้นตั้งไฟอ่อนกวนจนร้อน, ค่อย ๆ ใส่แป้งลงไปจนหมด กวนจนส่วนผสมร่อนจากกระทะ ปิดไฟ พักไว้ให้อุ่น, ตักขนมอัดเข้าพิมพ์ให้แน่นแล้วเคาะออก, แต่งหน้าขนมด้วยเศษทองคำเปลว","imageUrl": "/pj3.jpg" },
        { "id": 4, "Dessert": "ทองหยิบ","Mean": "ความร่ำรวย มั่งคั่ง หยิบจับการงานใดๆ ก็เป็นเงินเป็นทองและชีวิตคู่รุ่งเรือง","Popular": "ใช้ในงานมงคลหรือใช้เป็นขนมอวยพร" ,"Ingredient": "ไข่แดงเป็ด 10 ฟอง, น้ำลอยดอกมะลิ 5 ถ้วย, น้ำตาลทราย 5 ถ้วย","Procedure": "ตอกไข่เป็น ระวังอย่าให้ไข่แดงแตก จากนั้นก็แยกไข่แดงมาวางบนผ้าขาวบาง, บีบไข่แดงผ่านผ้าขาวบาง จนได้ไข่แดงที่เนียนละเอียด แล้วตีด้วยเครื่องตีจนเนียนฟู, เทน้ำลอยดอกมะลิลงในกระทะทองเหลือง แล้วนำน้ำตาลทรายลงไปเคี่ยวจนงวด, ใช้ช้อนตักไข่แล้วนำไปหยอดในน้ำเชื่อม หยอดให้ไข่แผ่เป็นแผ่นบางๆ แล้วพลิกกลับไปกลับมาให้สุกทั้งสองด้าน, นำขนมมาแช่ให้น้ำสะอาด จากนั้นก็ก็จับจีบให้ได้ 5 แฉก แล้วจัดลงใส่ถ้วยเล็กๆ","imageUrl": "/pj4.jpg" },
        { "id": 5, "Dessert": "ทองหยอด","Mean": "ขอให้ร่ำรวย มีเงินมีทองใช้","Popular": "ใช้เป็นขนมอวยพร" ,"Ingredient": "ไข่แดงของไข่เป็ด 9 ฟอง, แป้งทองหยอด 1/2 ถ้วย (หรือแป้งข้าวเจ้า), น้ำตาลทราย 2+1/2 ถ้วย, น้ำลอยดอกมะลิ 2+1/2 ถ้วย (ไม่ใส่ก็ได้)" ,"Procedure": "เทน้ำลอยดอกมะลิกับน้ำตาลทรายลงในกระทะทองเหลือง นำไปตั้งไฟแรงจนเดือดปุด ๆ และเคี่ยวต่ออีกประมาณ 10-15 นาที หรือจนน้ำเชื่อมข้น ตักส่วนหนึ่งออกมาสำหรับแช่ทองหยอดที่สุกแล้ว อีกส่วนหนึ่งตั้งไฟไว้, นำไข่แดงไปกรองด้วยผ้าขาวบาง ตีจนขึ้นฟู ใส่แป้งลงไป คนผสมจนเข้ากัน เสร็จแล้วนำไปหยอดในน้ำเชื่อมเดือด วิธีหยอดทำโดยใช้ปลายช้อนแกงตักส่วนผสมขึ้นมาแล้วใช้ปลายนิ้วโป้งดันลงไปในกระทะ หรือใช้นิ้วโป้ง นิ้วชี้ และนิ้วกลาง หยิบส่วนผสมขึ้นมาเป็นลูกพอเหมาะ แล้วสะบัดลงในน้ำเชื่อม พอสุกจะลอยขึ้นแล้วใช้กระชอนตักขึ้นมาพักไว้ในชามน้ำเชื่อม จัดใส่ภาชนะเสิร์ฟ","imageUrl": "/pj5.jpg" },
        { "id": 6, "Dessert": "ฝอยทอง","Mean": "คู่บ่าวสาวที่จะได้ครองรักกันยั่งยืนและมีอายุยืนยาวเหมือนฝอยทอง","Popular": "ให้เพื่อเสริมความยืดยาวแก่การแต่งงาน" ,"Ingredient": "ไข่แดงของไข่เป็ด 3 ฟอง, ไข่แดงของไข่ไก่ 2 ฟอง, กลิ่นดอกมะลิ ½ ช้อนชา, ใบเตย 1 ใบ, น้ำตาลทราย 600 ก, น้ำเปล่า 400 มล, เทียนอบ 1 ชิ้น" ,"Procedure": "นำน้ำเปล่า น้ำตาลทราย ใบเตย กลิ่นมะลิ ลงต้มในกระทะทองเหลือง เปิดไฟแรง ห้ามคนเด็ดขาดไม่อย่างนั้นน้ำตาลจะตกผลึก, ตีไข่ไก่และไข่เป็ดให้เข้ากัน นำไปกรองด้วยกระชอนตาถี่ จากนั้นตักไข่ใส่กรวยสำหรับทำฝอยทอง, ตักใบเตยออก และหยอดไข่ให้เป็นสาย วนให้รอบกระทะทองเหลืองประมาณ 20 - 30 รอบ ต่อ 1 ชิ้น, ใช้ไม้ปลายแหลม ค่อยๆช้อนฝอยทองขึ้นมาให้เป็นแผ่น วางพักไว้บนตะแกรง 30 นาที, จุดเทียนหอมให้มีควันขึ้นมา แล้วจึงดับไฟ นำเทียนหอมและขนมฝอยทอง อบรวมกันด้วยภาชนะปิด 10 นาที ก็จะได้ฝอยทองหอมๆ","imageUrl": "/pj6.jpg" },
        { "id": 7, "Dessert": "เม็ดขนุน","Mean": "มีคนช่วยสนับสนุนค้ำจุนในหน้าที่การงาน การดำเนินชีวิต ไม่ว่าจะประกอบกิจการใดๆ ก็จะประสบผลสำเร็จ","Popular": "ให้เพื่อค้ำจุน" ,"Ingredient": "ถั่วเขียวเลาะเปลือก (นึ่ง) 400 กรัมน้ำตาลทราย 1 1/2 ถ้วย, กะทิ 500 มิลลิลิตร, น้ำ 4 ถ้วย, น้ำตาลทราย 4 ถ้วย สำหรับต้มขนม, ไข่แดงของไข่เป็ด 8 ฟอง, น้ำเชื่อม" ,"Procedure": "นำถั่วเขียวเลาะเปลือกที่ืนึ่งแล้วมาปั่นกับน้ำตาลทรายและกะทิ (กะทิครึ่งเดียวก่อน) ปั่นจนละเอียด, นำถั่วที่ได้มากวนในกระทะทองเหลือง หรือกระทะเทฟลอนก็ได้ เติมกะทิส่วนที่เหลือลงไป กวนจนข้นเหนียว ใช้เวลา 15-20 นาที เสร็จแล้วก็ปิดไฟ พักถั่วไว้ให้เย็น, นำถั่วที่เย็นสนิทแล้ว มาปั้นให้เป็นรูปวงรี ยาวๆ เป็นรูปทรงเม็ดขนุน ปั้นไปแบบนี้จนหมด, ต้มน้ำตาลทรายกับน้ำเปล่าในกระทะทองเหลือง เปิดไฟอ่อน กวนจนน้ำตาลละลาย จากนั้นก็ปิดไฟทันที, แยกไข่แดงของไข่เป็ดออกมา จากนั้นก็ตีให้เข้ากัน นำถั่วที่ปั้นไว้มาชุบกับไข่แดง เสร็จแล้วก็หยอดลงไปในน้ำเชื่อม หยอดไปเรื่อยๆ ระวังอย่าให้ขนมติดกันจนเกินไป, จากนั้นก็เปิดไฟอ่อนๆ ต้มจนเม็ดขนุนสุกทั้งสองด้าน จากนั้นก็ตักเม็ดขนุนมาแช่ในน้ำเชื่อมข้างนอกอีกครั้งนึง ทำแบบนี้วนไปจนหมด, จัดเรียงขนมใส่จาน","imageUrl": "/pj7.jpg" },
        { "id": 8, "Dessert": "กลีบลำดวน","Mean": "ช่วยทำให้มีชื่อเสียงขจรขจายและยังมีสร้างความงดงามให้กับคู่ชีวิต","Popular": "ใช้ในงานมงคล" ,"Ingredient": "แป้งอเนกประสงค์ 2 ถ้วย, น้ำตาลไอซิ่ง 1 ถ้วย, เกลือ 1/8 ช้อนชา, น้ำมันพืช 112 มิลลิลิตร, เทียนหอม (เทียนอบ), น้ำมันพืชสำหรับส่วนผสมของแป้งส่วนเกสร 1 ช้อนโต๊ะ, สีผสมอาหาร ใส่หรือไม่ใส่ก็ได้" ,"Procedure": "ร่อนแป้ง น้ำตาล และเกลือเข้าด้วยกัน ค่อยๆ เทน้ำมันพืชลงไป กะให้เหลือประมาณ 1 ช้อนโต๊ะ, เมื่อนวดผสมเข้ากันดีแล้ว แบ่งแป้งไว้ประมาณ 1/4 ถ้วย เอาไว้สำหรับทำเกสรของกลีบลำดวน, แป้งที่เหลือสำหรับทำกลีบดอก โดยปั้นเป็นก้อนกลมๆ แล้วใช้มีดแบ่งออกเป็น 4 ส่วน, ใช้ด้านมุมของกลีบดอกสามกลีบ จับชนกันทะแยงมุม ผสมน้ำมันกับส่วนผสมที่แบ่งไว้ แล้วปั้นเป็นก้อนกลมไปติดไว้ตรงกลาง, นำเข้าเตาอบที่อุณหภูมิ 180 องศาเซลเซียส นานประม่าณ 12 นาที หรือจนขนมสุก นำขนมออกจากเตาพักไว้ให้เย็น วางใส่ในภาชนะที่มีฝาปิดมิดชิด, อบขนมด้วยควันเทียน ทิ้งข้ามคืน","imageUrl": "/pj8.jpg" },
        { "id": 9, "Dessert": "ถ้วยฟู","Mean": "ความเป็นสิริมงคลและความเจริญก้าวหน้าของชีวิตคู่ หรืออวยพรให้รุ่งเรืองเฟื่องฟูเหมือนขนมถ้วยฟู","Popular": "ใช้ในงานมงคลต่างๆ นำมาใช้ในพิธีแต่งงาน" ,"Ingredient": "แป้งข้าวเจ้า 1 ถ้วยตวง, น้ำตาลทราย 1/2 ถ้วยตวง, น้ำลอยดอกไม้ 1/2 ถ้วยตวง, ยีสต์ 1 ช้อนชา, ผงฟู 1 ช้อนชา" ,"Procedure": "ใส่ยีสต์ลงไปในแป้งข้าวเจ้าให้เข้ากัน ใส่น้ำลอยดอกไม้ทีละช้อน นวดจนแป้งนิ่มเนียน, ใส่น้ำตาลและน้ำทั้งหมดลงในแป้ง ใส่ผงฟู นวดต่อไป ปิดฝาครอบไว้ 1-2 ชั่วโมง, เรียงถ้วยตะไลลงในรังถึง นึ่งในน้ำเดือดจนถ้วยร้อนประมาณ 5 นาที,  ตักขนมที่ผสมไว้ลงในถ้วยตะไลพอเต็มปิดฝานึ่งให้สุกประมาณ 10-15 นาที ยกลงพักไว้ให้เย็น แล้วจึงแกะออกจากถ้วย","imageUrl": "/pj9.jpg" },
        { "id": 10, "Dessert": "เสน่ห์จันทน์","Mean": "การเป็นที่รักของทุกคน ไปไหนก็มีแต่คนรักใคร่ และความมีเสน่ห์","Popular": "ให้เพื่อเสริมความมีเสน่ห์" ,"Ingredient": "แป้งข้าวเหนียว 1/2 ถ้วยตวง, แป้งข้าวเจ้า 1 ถ้วยตวง, หัวกะทิ 3 ถ้วยตวง, น้ำตาลทราย 2 ถ้วยตวง, ไข่ไก่ 2 ฟอง, ผงจันป่น 1/2 ช้อนชา, สีผสมอาหารสีเหลือง" ,"Procedure": "ผสมแป้งทั้งสองชนิดเข้าด้วยกัน, ผสมหัวกะทิกับน้ำตาล ละลายแล้วกรองผสมแป้งกับกะทิ และผงจันป่นสีเหลือง, ตั้งไฟอ่อน กวนจนจับกัน, ไข่ไก่ใช้แต่ไข่แดง ใส่ขณะแป้งร้อน รีบคนให้เข้ากัน ยกลง, พอขนมอุ่นปั้นได้ ให้ปั้นเป็นรูปผลจัน ตรงขั้วผลใช้น้ำตาลเคี่ยวสีน้ำตาลหยอด","imageUrl": "/pj10.jpg" },
        { "id": 11, "Dessert": "กงหรือขนมกงเกวียน","Mean": "การอวยพรให้บ่าวสาวครองรักกันชั่วนิรันดร์","Popular": "ให้ในงานมงคลเพื่ออวยพรให้บ่าวสาว" ,"Ingredient": "ถั่วเขียว 1/2 ลิตร, แป้งข้าวเหนียว 1 ถ้วย, แป้งข้าวเจ้า 3 ถ้วย, น้ำตาลปี๊บ 2 ถ้วย, น้ำกะทิ 2 ถ้วย, เกลือป่น 1/2 ช้อนชา, ไข่ไก่ 1 ฟอง, ปูนแดง 1/2 ช้อนชา, ผงฟู 2 ช้อนชา","Procedure": "นำถั่วเขียวคั่วใส่ลงในกะทะ ใช้ไฟปานกลาง แล้วคั่วถั่วจนกรอบ แล้วนำมาบดให้ละเอียด, ผสมกะทิและน้ำตาลเข้าด้วยกัน ใส่กะทะตั้งไฟ กวนจนน้ำตาลละลายและกะทิเดือด, ใส่ถั่วเขียวบดและแป้งข้าวเหนียว กวนจนเข้ากันดีและเหนียวปั้นได้ ยกลงพักให้เย็น, ปั้นเป็นเส้นยาว แล้วขดเป็นวงกลม และปั้นอีก 2 เส้น แล้ววางพาดบนวงกลมเป็นกากบาท, ผสมแป้งข้าวเจ้า ไข่แดง ผงฟู ปูนแดง และเกลือ แล้วคนให้เข้ากัน, นำขนมกงมาชุบส่วนผสมแป้ง แล้วทอดจนแป้งสุกเหลือง พักไว้ให้สะเด็ดน้ำมัน","imageUrl": "/pj11.jpg" },
        { "id": 12, "Dessert": "สามเกลอ","Mean": "ความสามัคคีและไม่มีวันพรากจากกัน","Popular": "ใช้เป็นขนมเสี่ยงทายในงานแต่ง" ,"Ingredient": "แป้งข้าวเหนียว 2 ถ้วย, ถั่วทองเลาะเปลือกคั่วให้สุกบดหยาบ ๆ 1/2 ถ้วย, น้ำตาลปึก 1 ถ้วย, มะพร้าวทึนทึกขูดด้วยกระต่ายจีน 1 1/2 ถ้วย, น้ำ 5-8 ช้อนโต๊ะ" ,"Procedure": "นำมะพร้าวผสมกับน้ำตาลปึก แล้วกวนในกระทะทองด้ยวไฟกลาง, พอเริ่มจับตัวกันจะเหนียวจึงใส่ถั่วที่คั่วแล้วลงไปกวนต่อไปจนเหนียวปั้นได้ นำมาปั้นเป็นลูกกลม ๆ พักไว้, นำแป้งข้าวเหนียวนวดกับน้ำปั้นได้แล้วแผ่หุ้มไส้มะพร้าวไว้ทุกลูก, นำขนม 3 ลูก มาบีบให้ติดกันเป็นรูปสามเหลี่ยม เอาไม้เสียบให้ติดกันเป็นชุด (แบบเดียวกับขนมกง) แล้วนำไปชุบแป้งทอดอย่างขนมกง แป้งที่ใช้ชุบก็ใช้เช่นเดียวกัน","imageUrl": "/pj12.jpg" },
        { "id": 13, "Dessert": "ข้าวเหนียวแก้ว","Mean": "จะมีแต่ความเหนียวแน่น เป็นปึกแผ่นมั่นคง","Popular": "ใช้ในงานมงคลชีวิต" ,"Ingredient": "กะทิสด 1 กิโลกรัม, ข้าวเหนียว 1 กิโลกรัม, น้ำตาล 1 1/2 กิโลกรัม, นมแมว 1 ช้อนชา, เกลือ 2 ช้อนชา, ใบเตย 1 กำมือ, งาคั่ว 1 ถ้วย" ,"Procedure": "นำใบเตยไปบดใน้ครื่องปั่นกับน้ำ และคั้นเอา น้ำใบเตย สีเขียวๆ จากนั้นพักไว้ก่อน, เตรียม น้ำกะทิ ด้วยการเคี้ยวน้ำกะทิด้วยน้ำตาล 1 กิโลกรัม และเกลือ 2 ช้อนชา ให้ส่วนผสมละลายเข้ากัน จากนั้นพักเอาไว้ก่อน, นึ่ง ข้าวเหนียว ให้สุก ด้วยการนึ่งประมาณ 1 ชั่วโมง หลังจากแช่ ข้าวเหนียว ในน้ำมาแล้ว จากนั้นนำ ข้าวเหนียว ไปกวนในกะทิที่เตรียมเอาไว้แล้ว, จากนั้นนำ ข้าวเหนียว ลงไปกวนในกระทะทองเหลือง ใส่ น้ำตาล ลงไปอีก ครึ่งกิโลกรัม นมแมว น้ำใบเตย เคี้ยวประมาณ 15 นาที นำ ข้าวเหนียวแก้ว ลงใส่พิมพ์ที่เตรียมไว้ โรยด้วยงาคั่ว","imageUrl": "/pj13.jpg" },
        { "id": 14, "Dessert": "โพรงแสม","Mean": "เปรียบเสมือนเสาบ้านที่จะทำให้บ่าวสาวอยู่กันได้ยั่งยืนตลอดไป","Popular": "ใช้เป็นขนมแต่งงานที่เก่าแก่ ในสมัยโบราณ" ,"Ingredient": "แป้งสาลีอเนกประสงค์ 1 ถ้วย, เนยจืดที่อุณหภูมิห้อง 1 ช้อนโต๊ะ, ไข่ไก่เบอร์ 2 (เฉพาะไข่แดง) 1 ฟอง, เกลือ ¼; ช้อนชา, น้ำมันขี้โล้ 2 ช้อนโต๊ะ, น้ำลอยดอกมะลิ 2 – 3 ช้อนโต๊ะ, น้ำตาลมะพร้าวอย่างดี 1 ถ้วย, น้ำมันสำหรับทอด, แกนไม้ไผ่ตันเส้นผ่านศูนย์กลาง ประมาณ 2 เซนติเมตรยาว 15 เซนติเมตร สำหรับขึ้นรูปขนม" ,"Procedure": "ร่อนแป้งใส่อ่างผสมใบใหญ่ ใส่เนยและไข่แดงลงไป ผสมให้เข้ากันด้วยมือ จากนั้นใส่เกลือ น้ำมันขี้โล้ นวดพอเข้ากัน แล้วใส่น้ำทีละน้อย นวดให้แป้งนิ่มจนปั้นเป็นก้อนได้, แบ่งแป้งให้ได้ 10 ก้อนเท่า ๆ กัน จากนั้นนำมาหนึ่งก้อน คลึงเป็นเส้นยาวประมาณ 10 – 15 เซนติเมตร ใช้ไม้คลึงแป้งคลึงให้บางแป้งจะยาวขึ้นและมีหน้ากว้างประมาณ 4 เซนติเมตร นำไปพันแกนไม้ไผ่ที่เตรียมไว้ให้ได้รอบที่สวยงาม ตัดหัวและท้ายแป้งออกเล็กน้อยเพื่อให้ริมแป้งตรงและสวยงาม, นำไปทอดในน้ำมันร้อนโดยใช้ไฟอ่อนจนสีเหลืองสวย ตักขึ้น พักสักครู่ แล้วถอดแกนไม้ออก นำขนมลงทอดอีกครั้งให้ด้านในโพรงสุก ตักขึ้นพักให้สะเด็ดน้ำมัน ทำเช่นนี้จนแป้งหมด, ทำน้ำตาลราดขนมโดยนำน้ำตาลมะพร้าวใส่หม้อยกขึ้นตั้งไฟกลาง คนให้ละลาย พอเดือดปิดไฟ ยกลง ใช้ช้อนตักน้ำตาลราดเป็นเส้นตามแนวขวางลงบนขนมที่เย็นแล้วพักให้น้ำตาลเย็นสักครู่ พร้อมเสิร์ฟ ","imageUrl": "/pj14.jpg" },
        { "id": 15, "Dessert": "บุหลันดั้นเมฆ","Mean": "เลียนแบบเสมือนดวงจันทร์ลอยอยู่กลางท้องฟ้า","Popular": "ใช้เป็นขนมบุหลันดั้นเมฆนี้เป็นขนมเสี่ยงทาย เกี่ยวกับ หน้าที่การงาน" ,"Ingredient": "แป้งข้าวเจ้า 1 ถ้วยตวง, แป้งถั่ว 3 ช้อนโต๊ะ, น้ำตาลทราย 1 ถ้วยตวง, น้ำดอกมะลิ 3 ถ้วยตวง, ดอกอัญชัน 12-15 ดอก, ไข่ไก่ใช้แต่ไข่แดง 12 ฟอง, น้ำตาลทรายบดละเอียด 4 ช้อนโต๊ะ" ,"Procedure": "ต้มน้ำดอกมะลิ 1 ถ้วยตวงให้เดือดใส่น้ำตาลทรายลงไป พอเดือดสักครู่จึงยกลงทิ้งไว้ให้เย็น, นำดอกอัญชันเด็ดขั้วทิ้ง ล้างเบาๆ ให้สะอาดใส่ไว้ในถ้วยเล็กๆ เทน้ำร้อนจัดลงไป ชง เล็กน้อย จะได้น้ำสีดอกอัญชัน, แป้งข้าวเจ้าใส่ชามรวมกับแป้งถั่ว นวดด้วยน้ำลอยดอกมะลินิดหน่อย นวดไปสักครู่จึงเติมน้ำทั้งหมดลงไปละลายให้เข้ากัน แล้วเติมน้ำเชื่อม 1 ถ้วยตวง และสีอัญชัน 1-2 ช้อนชา, เรียงถ้วยตะไลเล็กๆ ในลังถึง นึ่งในน้ำเดือดพล่าน จนถ้วยร้อนจัด คนแป้งให้ทั่วแล้วตักหยอดให้ถ้วยเต็มโดยเร็ว เสร็จแล้วปิดฝาลังถึงนึ่งไปประมาณ 1 นาที แป้งจะจับขอบถ้วยเล็กน้อย เปิดฝาแล้วนำลังถึงลง หยิบถ้วยขนมเทแป้งส่วนที่ยังไม่สุกออกทุกถ้วย, ใช้ไข่แดงผสมกับน้ำตาลบดละเอียด ตักหยอดกลางถ้วยแทนที่แป้ง เทออกจนเต็ม นึ่งขนมต่อไปจนสุก ยกลงปล่อยให้เย็นจึงใช้ไม้พายเล็กๆ แคะขนมเรียงใส่จาน","imageUrl": "/pj15.jpg" }
      ]
    }
  
  
  router
    .route("/thaidesserts")
    .get((req, res) => {
      res.send(thaidesserts);
    })
    .post((req, res) => {
      console.log(req.body);
      let newthaidessert = {};
      newthaidessert.id = thaidesserts.list.length ? thaidesserts.list[thaidesserts.list.length - 1].id + 1 : 1;
      newthaidessert.Dessert = req.body.Dessert;
      newthaidessert.Mean= req.body.Mean;
      newthaidessert.Popular = req.body.Popular;
      newthaidessert.Ingredient= req.body.Ingredient;
      newthaidessert.Procedure= req.body.Procedure;
      newthaidessert.imageUrl= req.body.imageUrl;
      thaidesserts = { list: [...thaidesserts.list, newthaidessert] };
      res.json(thaidesserts);
    });
  
  router
    .route("/thaidesserts/:thaidessertid")
    .get((req, res) => {
      let id = thaidesserts.list.findIndex((item) => +item.id == +req.params.thaidessertid)
      res.json(thaidesserts.list[id]);
    })
    .put((req, res) => {
      let id = thaidesserts.list.findIndex((item) => item.id == +req.params.thaidessertid);
      thaidesserts.list[id].Dessert = req.body.Dessert;
      thaidesserts.list[id].Mean = req.body.Mean;
      thaidesserts.list[id].Popular = req.body.Popular;
      thaidesserts.list[id].Ingredient = req.body.Ingredient;
      thaidesserts.list[id].Procedure = req.body.Procedure;
      thaidesserts.list[id].imageUrl = req.body.imageUrl;
      res.json(thaidesserts.list);
    })
    .delete((req, res) => {
      thaidesserts.list = thaidesserts.list.filter((item) => +item.id !== +req.params.thaidessertid);
      res.json(thaidesserts.list);
    });
  
  
  router.route("/purchase/:thaidessertId")
  .post((req,res) => {
    let id = thaidesserts.list.findIndex((item) => +item.id == +req.params.thaidessertId)
    if (id == -1) {
      res.json({message: "thaidessert not found"})
    }
    else {
      thaidesserts.list = thaidesserts.list.filter((item) => +item.id !== +req.params.thaidessertId);
      res.json(thaidesserts.list);
    }
  })

// Error Handler
app.use((err, req, res, next) => {
  let statusCode = err.status || 500;
  res.status(statusCode);
  res.json({
    error: {
      status: statusCode,
      message: err.message,
    },
  });
});

// Start Server
app.listen(port, () => console.log(`Server is running on port ${port}`));