import Head from 'next/head'
import Layout from '../components/layout'
import Navbar from '../components/navbar'
import { useEffect, useState } from 'react'
import styles from '../styles/Home.module.css'
import axios from 'axios'
import withAuth from '../components/withAuth'
import config from '../config/config'
import "bootstrap/dist/css/bootstrap.css";
import { Container, Row, Col } from "react-bootstrap";

const Profile1 = () => {

    const [user, setUser] = useState({})

    useEffect(() => {
        profileUser()
    }, [])

    const profileUser = async () => {
        try {
            // console.log('token: ', token)
            const users = await axios.get(`${config.URL}/profile`, {
                headers: { Authorization: `Bearer ${token}` }
            })
            // console.log('user: ', users.data)
            setUser(users.data)
        }
        catch (e) {
            console.log(e)
        }

    }
 
    return (
        <Layout>
            <Head>
                <title>ขนมไทย</title>
            </Head>
            <div className={styles.container}>
                <Navbar/>
                <h1>ขนมไทย</h1>
                <div>
                    <b>ขนมไทย </b>
                    มีเอกลักษณ์ด้านวัฒนธรรมประจำชาติไทยคือ มีความละเอียดอ่อนประณีตในการเลือกสรรวัตถุดิบ วิธีการทำ ที่พิถีพิถัน รสชาติอร่อยหอมหวาน สีสันสวยงาม รูปลักษณ์ชวนรับประทาน ตลอดจนกรรมวิธีที่ประณีตบรรจง
                    <br/><br/>
                    <b>ประวัติขนมไทย</b><br/>
                    ในสมัยโบราณคนไทยจะทำขนมเฉพาะวาระสำคัญเท่านั้น เป็นต้นว่างานทำบุญ งานแต่ง เทศกาลสำคัญ หรือต้อนรับแขกสำคัญ เพราะขนมบางชนิดจำเป็นต้องใช้กำลังคนอาศัยเวลาในการทำพอสมควร ส่วนใหญ่เป็น ขนบประเพณี เป็นต้นว่า ขนมงาน เนื่องในงานแต่งงาน ขนมพื้นบ้าน เช่น ขนมครก ขนมถ้วย ฯลฯ ส่วนขนมในรั้วในวังจะมีหน้าตาสวยงาม ประณีตวิจิตรบรรจงในการจัดวางรูปทรงขนมสวยงาม
                    <br/>
                    ขนมไทยดั้งเดิม มีส่วนผสมคือ แป้ง น้ำตาล กะทิ เท่านั้น ส่วนขนมที่ใช้ไข่เป็นส่วนประกอบ เช่น ทองหยิบ ทองหยอด เม็ดขนุน นั้น มารี กีมาร์ เดอ ปีนา (ท้าวทองกีบม้า) หญิงสาวชาวโปรตุเกส เป็นผู้นำสูตรมาจากโปรตุเกส
                    <br/>
                    ขนมไทยที่นิยมทำกันทุกๆ ภาคของประเทศไทย ในพิธีการต่างๆ ก็คือขนมจากไข่ และเชื่อกันว่าชื่อและลักษณะของขนมนั้นๆ เช่น รับประทานฝอยทอง เพื่อหวังให้อยู่ด้วยกันยืดยาว มีอายุยืน รับประทาน ขนมชั้นก็ให้ได้เลื่อนขั้นเงินเดือน รับประทาน ขนมถ้วยฟูก็ขอให้เจริญ รับประทานขนมทองเอก ก็ขอให้ได้เป็นเอก เป็นต้น
                    <br/>
                    ในสมัยรัชกาลที่ 1 มีการพิมพ์ตำราอาหารออกเผยแพร่ รวมถึงตำราขนมไทยด้วย จึงนับได้ว่าวัฒนธรรมขนมไทยมีการบันทึกเป็นลายลักษณ์อักษรครั้งแรก ตำราอาหารไทยเล่มแรกคือแม่ครัวหัวป่าก์
ต่อมาเมื่อการค้าเจริญขึ้นในตลาดมีขนมนานาชนิดมาขาย และนับว่าเป็นยุคที่ขนมไทยเป็นที่นิยม
                    <br/><br/>
                    <b>การแบ่งประเภทของขนมไทย</b><br/>
                    แบ่งตามวิธีการทำให้สุกได้ดังนี้
                    <br/>
                    <li>ขนมที่ทำให้สุกด้วยการกวน ส่วนมากใช้กระทะทอง กวนตั้งแต่เป็นน้ำเหลวใสจนงวด แล้วเทใส่พิมพ์หรือถาดเมื่อเย็นจึงตัดเป็นชิ้น เช่น ตะโก้ ขนมลืมกลืน ขนมเปียกปูน ขนมศิลาอ่อน และผลไม้กวนต่าง ๆ รวมถึงข้าวเหนียวแดง ข้าวเหนียวแก้ว และกะละแม</li>
                    <br/>
                    <li>ขนมที่ทำให้สุกด้วยการนึ่ง ใช้ลังถึง บางชนิดเทส่วนผสมใส่ถ้วยตะไลแล้วนึ่ง บางชนิดใส่ถาดหรือพิมพ์ บางชนิดห่อด้วยใบตองหรือใบมะพร้าว เช่น ช่อม่วง ขนมชั้น ข้าวต้มผัด สาลี่อ่อน สังขยา ขนมกล้วย ขนมตาล ขนมใส่ไส้ ขนมเทียน ขนมน้ำดอกไม้ ข้าวเกรียบปากหม้อ</li>
                    <br/>
                    <li>ขนมที่ทำให้สุกด้วยการเชื่อม เป็นการใส่ส่วนผสมลงในน้ำเชื่อมที่กำลังเดือดจนสุก ได้แก่ ทองหยอด ทองหยิบ ฝอยทอง เม็ดขนุน กล้วยเชื่อม จาวตาลเชื่อม</li>
                    <br/>
                    <li>ขนมที่ทำให้สุกด้วยการทอด เป็นการใส่ส่วนผสมลงในกระทะที่มีน้ำมันร้อนๆ จนสุก เช่น กล้วยทอด ข้าวเม่าทอด ขนมกง ขนมค้างคาว ขนมฝักบัว ขนมนางเล็ด</li>
                    <br/>
                    <li>ขนมที่ทำให้สุกด้วยการนึ่งหรืออบ ได้แก่ ขนมหม้อแกง ขนมหน้านวล ขนมกลีบลำดวน ขนมทองม้วน สาลี่แข็ง นอกจากนี้ อาจรวม ขนมครก ขนมเบื้อง ขนมดอกลำเจียกที่ใช้ความร้อนบนเตาไว้ในกลุ่มนี้ด้วย</li>
                    <br/>
                    <li>ขนมที่ทำให้สุกด้วยการต้ม ขนมประเภทนี้จะใช้หม้อหรือกระทะต้มน้ำให้เดือด ใส่ขนมลงไปจนสุกแล้วตักขึ้น นำมาคลุกหรือโรยมะพร้าว ได้แก่ ขนมถั่วแปบ ขนมต้ม ขนมเหนียว ขนมเรไร นอกจากนี้ยังรวมขนมประเภทน้ำ ที่นิยมนำมาต้มกับกะทิ หรือใส่แป้งผสมเป็นขนมเปียก และขนมที่กินกับน้ำเชื่อมและน้ำกะทิ เช่น กล้วยบวชชี มันแกงบวด สาคูเปียก ลอดช่อง ซ่าหริ่ม</li>
                    <br/><br/>
                </div>
            </div>
        </Layout>
    )
}

export default Profile1

export function getServerSideProps({ req, res }) {
    return { props: { token: req.cookies.token || "" } };
}
